; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty ?x - robot)
        (handfull ?x - robot)
        (holding ?x - block)
    )
    (:action pick-up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put-down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld1)
    (:domain blocksworld)
    (:objects
        red_block - block
        blue_block - block
        purple_block - block
        pink_block - block
        robot - robot
    )
    (:init
        (ontable blue_block)
        (ontable red_block)
        (on pink_block purple_block)
        (on purple_block blue_block)
        (clear red_block)
        (clear pink_block)
        (handempty robot)
    )
    (:goal (and 
        (on red_block blue_block)
        (on blue_block purple_block)
        (on purple_block pink_block)
    ))
)

; plan
1. (unstack pink_block purple_block robot)
   deleted: (clear pink_block) (handempty robot) (on pink_block purple_block)
   added: (holding pink_block) (clear purple_block) (handfull robot)
   goals met: 0 of 3
2. (put-down pink_block robot)
   deleted: (holding pink_block) (handfull robot)
   added: (clear pink_block) (handempty robot) (ontable pink_block)
   goals met: 0 of 3
3. (unstack purple_block blue_block robot)
   deleted: (clear purple_block) (handempty robot) (on purple_block blue_block)
   added: (holding purple_block) (clear blue_block) (handfull robot)
   goals met: 0 of 3
4. (put-down purple_block robot)
   deleted: (holding purple_block) (handfull robot)
   added: (clear purple_block) (handempty robot) (ontable purple_block)
   goals met: 0 of 3
5. (pick-up red_block robot)
   deleted: (ontable red_block) (clear red_block) (handempty robot)
   added: (handfull robot) (holding red_block)
   goals met: 0 of 3
6. (stack red_block blue_block robot)
   deleted: (holding red_block) (clear blue_block) (handfull robot)
   added: (clear red_block) (handempty robot) (on red_block blue_block)
   goals met: 1 of 3
7. (pick-up purple_block robot)
   deleted: (ontable purple_block) (clear purple_block) (handempty robot)
   added: (handfull robot) (holding purple_block)
   goals met: 1 of 3
8. (stack purple_block pink_block robot)
   deleted: (holding purple_block) (clear pink_block) (handfull robot)
   added: (clear purple_block) (handempty robot) (on purple_block pink_block)
   goals met: 2 of 3
9. (unstack red_block blue_block robot)
   deleted: (clear red_block) (handempty robot) (on red_block blue_block)
   added: (holding red_block) (clear blue_block) (handfull robot)
   goals met: 1 of 3
10. (put-down red_block robot)
   deleted: (holding red_block) (handfull robot)
   added: (clear red_block) (handempty robot) (ontable red_block)
   goals met: 1 of 3
11. (pick-up blue_block robot)
   deleted: (ontable blue_block) (clear blue_block) (handempty robot)
   added: (handfull robot) (holding blue_block)
   goals met: 1 of 3
12. (stack blue_block purple_block robot)
   deleted: (holding blue_block) (clear purple_block) (handfull robot)
   added: (clear blue_block) (handempty robot) (on blue_block purple_block)
   goals met: 2 of 3
13. (pick-up red_block robot)
   deleted: (ontable red_block) (clear red_block) (handempty robot)
   added: (handfull robot) (holding red_block)
   goals met: 2 of 3
14. (stack red_block blue_block robot)
   deleted: (holding red_block) (clear blue_block) (handfull robot)
   added: (clear red_block) (handempty robot) (on red_block blue_block)
   goals met: 3 of 3
